Repository: vdhamer/Photo-Club-Hub-HTML
Catalog: Photo Club Hub HTML/Package/Localization/Package.xcstrings
Source language: en
Languages: nl

source: and
nl: en

source: chairman
nl: voorzitter

source: deceased
nl: overleden

source: external coach
nl: mentor

source: former
nl: voormalig

source: honorary member
nl: erelid

source: member
nl: lid

source: museums
nl: musea

# No remark currently available for %@ %@.
source: No remark currently available for %1$@ %2$@.
nl: Geen bijzonderheden bekend over %@ %@.

# of2
source: of
nl: van

source: other
nl: bestuurslid

source: prospective member
nl: aspirant-lid

source: secretary
nl: secretaris

source: treasurer
nl: penningmeester

source: unknowns
nl: onbekenden

source: Unofficial expertise. It has no translations yet.
nl: Dit is nog geen officieel expertise, en heeft geen vertalingen.

source: vice-chairman
nl: vicevoorzitter
